blog/2021/05/06/bayes/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>模型: 贝叶斯定理 - 你对这个世界要有点意见</title>
  <meta charset="utf-8" />
  <meta name="author" content="lijigang" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="&lt;TODO: insert your keywords here&gt;" />


  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">你对这个世界要有点意见</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/lijigang">GitHub</a></li>
          <li><a href="http://www.zhihu.com/people/lijigang.com">知乎</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row post-content">
        <div class="col-md-2"></div>
            <h1>模型: 贝叶斯定理</h1>
            <p>
两个事情A 和 B同时发生的概率, 如果以A 事情为坐标系, 则为:
</p>

<p>
\[P(AB) = P(A)P(B|A)\]
</p>

<p>
如果以B 事情为坐标系, 则为:
</p>

<p>
\[P(AB) = P(B)P(A|B)\]
</p>

<p>
这两个公式计算的是同一个事情P(AB), 所以
</p>

<p>
\[P(A)P(B|A) = P(B)P(A|B)\]
</p>

<p>
即
</p>

<p>
\[ P(A|B) = P(A) \cdot P(B|A) / P(B) \]
</p>

<p>
这就是大名鼎鼎的Bayes 定理。
</p>

<p>
对于上面的推演过程, 有两个人生启发。
</p>

<div id="outline-container-org2ba61cb" class="outline-2">
<h2 id="org2ba61cb">人生就是一个Bayes 过程</h2>
<div class="outline-text-2" id="text-org2ba61cb">
<p>
你做决定时不可能全知全能, 只能是基于当前你的认知, 来做出当下最好的判断。
即使你知道现在做的判断离真实答案还有距离, 但也要勇于做出这个起步的判断。
</p>

<p>
当后面有新的信息纳入时, 再基于新的信息，来更新其之前的判断。
</p>

<p>
这就是Bayes 思维, 有这种思维的人, 心里会非常清楚自己并不是 <code>Mr. Right</code>,
常常会说 <b>我所说的都是错的</b> 之类的话; 他会对信息透明非常在意, 因为只有当
信息能高效传输时, 才能更快更好地更新自己的认知判断。
</p>
</div>
</div>

<div id="outline-container-org01086dc" class="outline-2">
<h2 id="org01086dc">遇到难题多尝试切换视角</h2>
<div class="outline-text-2" id="text-org01086dc">
<p>
什么是视角? 就是你 <b>怎么看</b> 一个东西, 你把这个东西 <b>看成什么</b> 。
</p>

<p>
比如, 现在有一大盆鱼, 里面有各种品种:
</p>
<ul class="org-ul">
<li>外行可能看到的是: 有的大, 有的小</li>
<li>渔民可能看到的是: 思考这些鱼是怎么捕捞上来的</li>
<li>卖鱼的可能看到的是: 哪个鱼贵些, 哪个鱼便宜些</li>
<li>你可能看到的是: 那个好像更好吃些?</li>
</ul>

<p>
这些不同的 <b>看法</b> , 就是视角。
</p>

<p>
视角的选择，对于解题的难易, 影响非常大。
</p>

<p>
你要描述一个正方形的顶点, 用直角坐标系非常方便; 而要描述一个圆弧, 那
就最适合用极坐标。
</p>

<p>
元素周期表, 就是使用了 <b>原子量</b> 的视角(质子的个数), 纷繁无序的各种元素
一下子就有了章法。
</p>

<blockquote>
<p>
对于任何一个问题, 都存在一个能让答案一目了然,脱颖而出的视角。
</p>
</blockquote>

<p>
这话说着容易, 但真要找到那个视角,可能非常困难。
</p>

<p>
但是, 这个定理, 给了我们希望。当一道难题摆在你的面前, 可能当前谁都不
知道怎么解决它, 但是你要相信，总有一个视角, 会让答案看上去那么简单,
那么自然。
</p>
</div>
</div>

    </div>
</section>




<footer id="footer">
    <br />
    <script>
        var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "https://hm.baidu.com/hm.js?36d44a2295ffa55a3ab51c6aa7a71733";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();
    </script>
</footer>

  </body>
</html>
